app/Controllers/Admin.php

SELECT *
FROM `users`
WHERE `users`.`id` = '8'
---
    public function profile()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/auth/login');
        }

        $userId = session()->get('userId');
        $user = $this->userModel->find($userId);

SELECT *
FROM `users`
WHERE `users`.`id` = '8'
---
public function updateProfile()
{
    if (!session()->get('isLoggedIn')) {
        return redirect()->to('/auth/login');
    }

    $userId = session()->get('userId');
    $user = $this->userModel->find($userId);

UPDATE `users` SET `full_name` = 'Admin', `email` = 'admin@gmail.com', `updated_at` = '2026-08-07 08:45:18'
WHERE `users`.`id` IN ('8')
---
    }

    try {
        $this->userModel->update($userId, $updateData);

INSERT INTO `audit_logs` (`user_id`, `action`, `description`, `ip_address`, `created_at`) VALUES ('8', 'UPDATE_PROFILE', 'Updated admin profile information', '::1', '2026-08-07 08:45:18')
---
        }

        // Log the activity
        $this->auditLogModel->insert([
            'user_id' => $userId,
            'action' => 'UPDATE_PROFILE',
            'description' => 'Updated admin profile information',
            'ip_address' => $this->request->getIPAddress(),
            'created_at' => date('Y-m-d H:i:s')
        ]);