app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
INSERT INTO `audit_logs` (`user_id`, `action`, `description`, `ip_address`, `user_agent`, `created_at`) VALUES ('8', 'LOGIN', 'User logged into the system', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/150.0.0.0 Safari/537.36', '2026-08-07 08:45:54')
---
    public function processLogin()
    {
        $validation = \Config\Services::validation();

        $validation->setRules([
            'username' => 'required',
            'password' => 'required|min_length[6]'
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->back()->withInput()->with('errors', $validation->getErrors());
        }

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $this->userModel->where('username', $username)->first();

        if ($user && password_verify($password, $user['password'])) {
            // Set session data
            $sessionData = [
                'userId' => $user['id'],
                'username' => $user['username'],
                'fullName' => $user['full_name'],
                'isLoggedIn' => true
            ];
            session()->set($sessionData);

            // Log the login activity
            $this->auditLogModel->insert([
                'user_id' => $user['id'],
                'action' => 'LOGIN',
                'description' => 'User logged into the system',
                'ip_address' => $this->request->getIPAddress(),
                'user_agent' => $this->request->getUserAgent(),
                'created_at' => date('Y-m-d H:i:s')
            ]);

INSERT INTO `audit_logs` (`user_id`, `action`, `description`, `ip_address`, `user_agent`, `created_at`) VALUES ('8', 'LOGOUT', 'User logged out of the system', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/150.0.0.0 Safari/537.36', '2026-08-07 08:45:22')
---
    public function logout()
    {
        // Log the logout activity
        if (session()->get('isLoggedIn')) {
            $this->auditLogModel->insert([
                'user_id' => session()->get('userId'),
                'action' => 'LOGOUT',
                'description' => 'User logged out of the system',
                'ip_address' => $this->request->getIPAddress(),
                'user_agent' => $this->request->getUserAgent(),
                'created_at' => date('Y-m-d H:i:s')
            ]);