app/Controllers/Dashboard.php

    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/auth/login');
        }

        // Get dashboard statistics
        $totalPwd = $this->pwdProfileModel->where('status', 'active')->countAllResults();
        $totalAssistance = $this->assistanceModel->countAll();
        $totalReservations = $this->reservationModel->where('status', 'pending')->countAllResults();

        // Get disability type distribution
        $disabilityStats = $this->pwdProfileModel
            ->select('disability_type, COUNT(*) as count')
            ->where('status', 'active')
            ->groupBy('disability_type')
            ->findAll();

        // Recent assistance activities
        $recentAssistance = $this->assistanceModel
            ->select('assistance_records.*, pwd_profiles.full_name')
            ->join('pwd_profiles', 'pwd_profiles.id = assistance_records.pwd_id')
            ->orderBy('assistance_records.created_at', 'DESC')
            ->limit(5)
            ->findAll();

        // Upcoming reservations
        $upcomingReservations = $this->reservationModel
            ->select('reservations.*, pwd_profiles.full_name')
            ->join('pwd_profiles', 'pwd_profiles.id = reservations.pwd_id')
            ->where('reservations.reservation_date >=', date('Y-m-d'))
            ->where('reservations.status', 'pending')
            ->orderBy('reservations.reservation_date', 'ASC')
            ->limit(5)
            ->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `pwd_profiles`
WHERE `status` = 'active'
AND `pwd_profiles`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `reservations`
WHERE `status` = 'pending'
SELECT `disability_type`, COUNT(*) as count
FROM `pwd_profiles`
WHERE `status` = 'active'
AND `pwd_profiles`.`deleted_at` IS NULL
GROUP BY `disability_type`
SELECT `assistance_records`.*, `pwd_profiles`.`full_name`
FROM `assistance_records`
JOIN `pwd_profiles` ON `pwd_profiles`.`id` = `assistance_records`.`pwd_id`
ORDER BY `assistance_records`.`created_at` DESC
 LIMIT 5
SELECT `reservations`.*, `pwd_profiles`.`full_name`
FROM `reservations`
JOIN `pwd_profiles` ON `pwd_profiles`.`id` = `reservations`.`pwd_id`
WHERE `reservations`.`reservation_date` >= '2026-08-07'
AND `reservations`.`status` = 'pending'
ORDER BY `reservations`.`reservation_date` ASC
 LIMIT 5